src/InformationRegisters/am_ХранилищеНастроек/am_ХранилищеНастроек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>am_ХранилищеНастроек</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Boolean</types>
      <types>CatalogRef.ВидыДисконтныхКарт</types>
      <types>CatalogRef.АвтоматическиеСкидки</types>
      <types>CatalogRef.ВидыЦен</types>
      <types>String</types>
      <types>CatalogRef.Номенклатура</types>
      <types>Date</types>
      <types>Number</types>
      <types>CatalogRef.ХранилищеШаблонов</types>
      <types>CatalogRef.Контрагенты</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Ключ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/am_ХранилищеНастроек/ManagerModule.bsl
#Область Описание

//Для каждой настройки своя функция получения
//Имя настройки(Ключ) добавляем в функцию "СписокВыбора()" чтобы пользователь не добавил своей настройки
//Пример:
//Функция ПолучитьНашуПервуюНастройку() Экспорт
//	
//	Возврат ПолучитьЗначениеНастройки("Настройка_тест");
//	
//КонецФункции

#КонецОбласти

#Область ФункцииПолучения

Функция ПолучитьУпущенныйСпрос() Экспорт
	
	Возврат ПодготовитьЗначенияНастроекКОтправке("УпущенныйСпрос", Ложь)
		
КонецФункции

Функция ПолучитьУпущенныйСпросНФС() Экспорт
	
	Возврат ПодготовитьЗначенияНастроекКОтправке("УпущенныйСпросНФС", Ложь)
		
КонецФункции

Функция ПолучитьУпущенныйСпросНФП() Экспорт
	
	Возврат ПодготовитьЗначенияНастроекКОтправке("УпущенныйСпросНФП", Ложь)
		
КонецФункции

Функция ПолучитьОбменССТО() Экспорт
	
	Возврат ПодготовитьЗначенияНастроекКОтправке("ОбменССТО", Ложь)
	
КонецФункции

Функция ПолучитьРазмещениеАвтоВЗП() Экспорт
	
	Возврат ПодготовитьЗначенияНастроекКОтправке("АвтоВЗП", Ложь)
		
КонецФункции

Функция ПолучитьРазмещениеАвтоВЧККМ() Экспорт
	
	Возврат ПодготовитьЗначенияНастроекКОтправке("АвтоВЧККМ", Ложь)
		
КонецФункции

Функция ПолучитьПульсБизнесаБазовыеНастройки() Экспорт
	
	Возврат ПодготовитьЗначенияНастроекКОтправке("ПульсБизнесаБазовыеНастройки", Ложь)
		
КонецФункции

Функция ПолучитьПростаяФормаКарточкиНоменклатуры() Экспорт
	
	Возврат ПодготовитьЗначенияНастроекКОтправке("УпрощеннаяФормаНоменклатуры", Ложь)
		
КонецФункции

Функция ПолучитьКонтрольНижеЗакупаЗаказПокупателя() Экспорт
	
	Возврат ПодготовитьЗначенияНастроекКОтправке("НижеЗакупочнойЗП", Ложь)
		
КонецФункции

Функция ПолучитьКонтрольНижеЗакупаЧекККМ() Экспорт
	
	Возврат ПодготовитьЗначенияНастроекКОтправке("НижеЗакупочнойЧККМ", Ложь)
		
КонецФункции

Функция ПолучитьИсточникОбращения() Экспорт
	
	Возврат ПодготовитьЗначенияНастроекКОтправке("ФиксироватьОткудаПришёлКлиент", Ложь)
		
КонецФункции

Функция ПолучитьКонтрольНижеЗакупаРН() Экспорт
	
	Возврат ПодготовитьЗначенияНастроекКОтправке("НижеЗакупочнойРН", Ложь)
		
КонецФункции

Функция ПолучитьВидимостьТЧЗаказаПокупателяПоказатьАртикул() Экспорт
	
	Возврат ПодготовитьЗначенияНастроекКОтправке("ТЧЗаказаПокупателяПоказатьАртикул", Ложь)
		
КонецФункции

Функция ПолучитьВидимостьТЧЗаказаПокупателяПоказатьБренд() Экспорт
	
	Возврат ПодготовитьЗначенияНастроекКОтправке("ТЧЗаказаПокупателяПоказатьБренд", Ложь)
		
КонецФункции

Функция ПолучитьВидимостьТЧЗаказаПокупателяПоказатьКатегории() Экспорт
	
	Возврат ПодготовитьЗначенияНастроекКОтправке("ТЧЗаказаПокупателяПоказатьКатегории", Ложь)
		
КонецФункции

Функция ПолучитьВидимостьТЧЗаказаПокупателяПоказатьПоставщика() Экспорт
	
	Возврат ПодготовитьЗначенияНастроекКОтправке("ТЧЗаказаПокупателяПоказатьПоставщика", Ложь)
		
КонецФункции

Функция ПолучитьДоступностьОстаткиИРезервыЧекККМ() Экспорт
		
	Возврат ПодготовитьЗначенияНастроекКОтправке("ДоступностьОстаткиИРезервыЧекККМ", Ложь)
	
КонецФункции

Функция ПолучитьСохранятьЦенуПокупкиПриПроведении() Экспорт
	
	Возврат ПодготовитьЗначенияНастроекКОтправке("СохранятьЦенуПокупкиПриПроведении", Ложь)
		
КонецФункции

Функция РазрешитьУдерживатьКомиссиюПриВозвратеТовара() Экспорт
	
	Возврат ПодготовитьЗначенияНастроекКОтправке("УдержаниеКомиссииПриВозврате", Ложь)
		
КонецФункции

Функция ПолучитьПроцентКомиссииПоУмолчанию() Экспорт
	
	Возврат ПодготовитьЗначенияНастроекКОтправке("ПроцентКомиссииПоУмолчанию", 0)
		
КонецФункции

Функция ПолучитьУслугуКомиссииПоУмолчанию() Экспорт
	
	Возврат ПодготовитьЗначенияНастроекКОтправке("УслугаКомиссииПоУмолчанию", Справочники.Номенклатура.ПустаяСсылка())
		
КонецФункции

Функция ПолучитьВидЦенДляРегистрацииПрихода() Экспорт
	
	Возврат ПодготовитьЗначенияНастроекКОтправке("ЗакупочнаяЦена", Справочники.ВидыЦен.Учетная)
		
КонецФункции

Функция ПолучитьБлокЦены() Экспорт
	
	Возврат ПодготовитьЗначенияНастроекКОтправке("БлокЦены", Ложь)
		
КонецФункции

Функция ПолучитьДоступКМаркетингу() Экспорт
	
	Возврат ПодготовитьЗначенияНастроекКОтправке("РазделМаркетинг", Ложь)
		
КонецФункции

Функция ПолучитьВидДисконтнойКартыПоУмолчанию() Экспорт
	
	Возврат ПодготовитьЗначенияНастроекКОтправке("ВидДисконтнойКартыПоУмолчанию", Справочники.АвтоматическиеСкидки.ПустаяСсылка())
		 
КонецФункции

Функция АкцияДоступнаСкидкаНаВторуюПокупку() Экспорт
	
	Возврат ПодготовитьЗначенияНастроекКОтправке("АкцияСкидкаНаВторуюПокупку", Ложь)
		
КонецФункции


Функция ПолучитьРазрешитьПроцентНаценкиВБрендах() Экспорт
	
	Возврат ПодготовитьЗначенияНастроекКОтправке("ПроцентНаценкиДляБренда", Ложь)
		
КонецФункции

Функция ПолучитьПроцентНаценкиВБрендахПоУмолчанию() Экспорт
	
	Возврат ПодготовитьЗначенияНастроекКОтправке("ПроцентНаценкиДляБрендаПоУмолчанию", 0)
		
КонецФункции

Функция ПолучитьВидЦенРозница() Экспорт
	
	Возврат ПодготовитьЗначенияНастроекКОтправке("ЦеныВидЦенРозница", 0)
		
КонецФункции

Функция ПолучитьВидЦенЗакуп() Экспорт
	
	Возврат ПодготовитьЗначенияНастроекКОтправке("ЦеныВидЦенЗакуп", 0)
		
КонецФункции

Функция ПолучитьРазрешитьАссистентуСоздаватьЗаказыПоставщикам() Экспорт
	
	Возврат ПодготовитьЗначенияНастроекКОтправке("РазрешитьАссистентуСоздаватьЗаказыПоставщикам", Ложь)
		
КонецФункции

Функция ПолучитьСостояниеАктивацииАссистентаЗакупок() Экспорт
	
	Возврат ПодготовитьЗначенияНастроекКОтправке("АссистентЗакупок", Ложь)
		
КонецФункции

Функция ПолучитьРазрешениеНаУстановкуМинИМаксУровеньПоставки() Экспорт
	
	Возврат ПодготовитьЗначенияНастроекКОтправке("МинИМаксУровеньПоставки", Ложь)
		
КонецФункции

Функция ПолучитьСохраненноеЗначение(Ключ, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ключ",Ключ);
	Запрос.Текст = "ВЫБРАТЬ
	|	am_ХранилищеНастроек.Ключ КАК Ключ,
	|	am_ХранилищеНастроек.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.am_ХранилищеНастроек КАК am_ХранилищеНастроек
	|ГДЕ
	|	am_ХранилищеНастроек.Ключ = &Ключ";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Значение;
	Иначе
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьРазрешениеОтбораДеталейПоАвтомобилю() Экспорт
	
	Возврат ПодготовитьЗначенияНастроекКОтправке("ОтборДеталейПоАвтомобилю", Ложь)
		
КонецФункции

Функция ПолучитьШаблон() Экспорт
	
	Возврат ПодготовитьЗначенияНастроекКОтправке("Шаблон", Справочники.ХранилищеШаблонов.ПустаяСсылка())
		
КонецФункции

Функция ПолучитьРазрешениеОбменСШите_МПлюс() Экспорт
	
	Возврат ПодготовитьЗначенияНастроекКОтправке("ОбменСШате_МПлюс", Ложь)
		
КонецФункции

Функция ПолучитьРазрешениеЗагружатьСчетаФактурыЭксель() Экспорт
	Возврат ПодготовитьЗначенияНастроекКОтправке("РазрешитьЗагружатьСчетаФактурыЭксель", Ложь);	
КонецФункции

Функция ПолучитьШите_МПлюсПоУмолчанию() Экспорт
	Возврат ПодготовитьЗначенияНастроекКОтправке("Поставщик_Шате_М", Справочники.Контрагенты.ПустаяСсылка());	
КонецФункции


//Гринлайт
Функция ПолучитьРазрешениеОбменСГринлайт() Экспорт
	Возврат ПодготовитьЗначенияНастроекКОтправке("ОбменСГринлайт", Ложь);	
КонецФункции

Функция ПолучитьРазрешениеЗагружатьРеализациюТоваровИУслугЭксель() Экспорт
	Возврат ПодготовитьЗначенияНастроекКОтправке("ЗагружатьРеализациюТоваровИУслугЭксель", Ложь);	
КонецФункции

Функция ПолучитьГринлайтПоУмолчанию() Экспорт
	Возврат ПодготовитьЗначенияНастроекКОтправке("ПоставщикГринлайт", Справочники.Контрагенты.ПустаяСсылка());	
КонецФункции

//МАвто
Функция ПолучитьРазрешениеОбменСМАвто() Экспорт
	Возврат ПодготовитьЗначенияНастроекКОтправке("ОбменСМАвто", Ложь);	
КонецФункции

Функция ПолучитьРазрешениеЗагружатьУниверсальныйПредаточныйДокумент() Экспорт
	Возврат ПодготовитьЗначенияНастроекКОтправке("ЗагружатьУниверсальныйПредаточныйДокумент", Ложь);	
КонецФункции

Функция ПолучитьМАвтоПоУмолчанию() Экспорт
	Возврат ПодготовитьЗначенияНастроекКОтправке("ПоставщикМАвто", Справочники.Контрагенты.ПустаяСсылка());	
КонецФункции

// Берк
Функция ПолучитьРазрешениеОбменСБерк() Экспорт
	Возврат ПодготовитьЗначенияНастроекКОтправке("БеркОбмен", Ложь);	
КонецФункции

Функция ПолучитьБеркПоУмолчанию() Экспорт
	Возврат ПодготовитьЗначенияНастроекКОтправке("ПоставщикБерк", Ложь);	
КонецФункции

Функция ПолучитьРазрешениеЗагружатьExcelБерк() Экспорт
	Возврат ПодготовитьЗначенияНастроекКОтправке("ЗагружатьExcelБерк", Ложь);	
КонецФункции

//

Функция ПолучитьОтображатьНомерКлиентаУПоставщика() Экспорт
	Возврат ПодготовитьЗначенияНастроекКОтправке("am_ОтображатьНомерКлиентаУПоставщика", Ложь);	
КонецФункции


Функция ПолучитьОтображатьРучнуюСкидку() Экспорт
	Возврат ПодготовитьЗначенияНастроекКОтправке("ОтображатьРучнуюСкидку", Ложь);	
КонецФункции

// Автоматическое проставление УСН

Функция ПолучитьПроставлятьУСНПоступлениеВКассу() Экспорт
	Возврат ПодготовитьЗначенияНастроекКОтправке("ПроставлятьУСНПоступлениеВКассу", Истина);	
КонецФункции

Функция ПолучитьПроставлятьУСНПоступлениеНаСчет() Экспорт
	Возврат ПодготовитьЗначенияНастроекКОтправке("ПроставлятьУСНПоступлениеНаСчет", Истина);	
КонецФункции


Функция ПолучитьПроставлятьУСНРасходИзКассы() Экспорт
	Возврат ПодготовитьЗначенияНастроекКОтправке("ПроставлятьУСНРасходИзКассы", Истина);	
КонецФункции


Функция ПолучитьПроставлятьУСНРасходнаяНакладнаяВозврат() Экспорт
	Возврат ПодготовитьЗначенияНастроекКОтправке("ПроставлятьУСНРасходнаяНакладнаяВозврат", Истина);	
КонецФункции


Функция ПолучитьПроставлятьУСНРасходСоСчета() Экспорт
	Возврат ПодготовитьЗначенияНастроекКОтправке("ПроставлятьУСНРасходСоСчета", Истина);	
КонецФункции

//

Функция ПолучитьАвтоматическиЗаполнятьПоСкладам() Экспорт
	Возврат ПодготовитьЗначенияНастроекКОтправке("АвтоматическиЗаполнятьПоСкладам", Ложь);	
КонецФункции


#КонецОбласти

#Область Служебные

Функция УстановитьЗначение(Ключ, Значение) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МЗ = РегистрыСведений.am_ХранилищеНастроек.СоздатьМенеджерЗаписи();
	МЗ.Ключ = Ключ;
	МЗ.Значение = Значение;
	МЗ.Записать(Истина);
	
КонецФункции

Функция ПодготовитьЗначенияНастроекКОтправке(Имя, ЗначениеПоУмолчанию)
	
	ЗначениеНастройки =  ПолучитьЗначениеНастройки(Имя);
	
	Если ЗначениеНастройки = Неопределено Тогда
		Возврат ЗначениеПоУмолчанию;
	Иначе
		Возврат ЗначениеНастройки;
	КонецЕсли;	
	
КонецФункции

#КонецОбласти

#Область ФункцииЧтенияНастроек

Функция ПолучитьЗначениеНастройки(Ключ)
	
	НайденноеЗначение = Неопределено;
	Список().Свойство(Ключ, НайденноеЗначение);
	
	Возврат НайденноеЗначение;
	
КонецФункции

Функция Список()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ХранилищеНастроек.Ключ КАК Ключ,
	               |	ХранилищеНастроек.Значение КАК Значение
	               |ИЗ
	               |	РегистрСведений.am_ХранилищеНастроек КАК ХранилищеНастроек";
	Выборка = Запрос.Выполнить().Выбрать();
	СтруктураОтвет = Новый Структура;
	Пока Выборка.Следующий() Цикл
		
		СтруктураОтвет.Вставить(Выборка.Ключ, Выборка.Значение);
		
	КонецЦикла;
	
	Возврат СтруктураОтвет;
	
КонецФункции

#КонецОбласти
